; domain
; Rocket domain used in (Nguyen & Kambhampati 2001) + Fuel levels

(define (domain rockets)
  (:predicates (cargo ?object)
	       (rocket ?rocket)
	       (place ?place)
	       (at ?object ?place)
	       (in ?object ?rocket)
	       (flevel ?l)
	       (fuel-level ?a ?l) (next ?l1 ?l2)
)
  (:action load
	   :parameters (?object ?rocket ?place)
	   :precondition (and (cargo ?object) (rocket ?rocket) (place ?place)
			      (at ?rocket ?place) (at ?object ?place))
	   :effect (and (in ?object ?rocket) (not (at ?object ?place))))
  (:action unload
	   :parameters (?object ?rocket ?place)
	   :precondition (and (cargo ?object) (rocket ?rocket) (place ?place)
			      (at ?rocket ?place) (in ?object ?rocket))
	   :effect (and (at ?object ?place) (not (in ?object ?rocket))))
  (:action move
	   :parameters (?rocket ?from ?to ?l1 ?l2)
	   :precondition (and (rocket ?rocket) (place ?from) (place ?to)
			      (at ?rocket ?from)
                              (flevel ?l1) (flevel ?l2)
			      (fuel-level ?rocket ?l1) (next ?l2 ?l1)
                         )
	   :effect (and (at ?rocket ?to) 
			(not (at ?rocket ?from))
			(fuel-level ?rocket ?l2)
			(not (fuel-level ?rocket ?l1))
  		    ))
  (:action refuel
   :parameters ( ?rocket ?l ?l1)
   :precondition
	     (and (rocket ?rocket) (flevel ?l) (flevel ?l1)  (fuel-level ?rocket ?l) (next ?l ?l1) )
    :effect
        (and (fuel-level ?rocket ?l1) (not (fuel-level ?rocket ?l))))

)

; problem
(define (problem rocket-1)
  (:domain rockets)
  (:objects london paris jfk bos r1 r2 r3  r4  avrim 
        fl0
        fl1
        fl2
        fl3
        fl4
        fl5
        fl6 )
  (:init    
        (next fl0 fl1)
        (next fl1 fl2)
        (next fl2 fl3)
        (next fl3 fl4)
        (next fl4 fl5)
        (next fl5 fl6)
        (flevel fl0)
        (flevel fl1)
        (flevel fl2)
        (flevel fl3)
        (flevel fl4)
        (flevel fl5)
        (flevel fl6)
        
        (fuel-level r1 fl6)
        (fuel-level r2 fl5)     
        (fuel-level r3 fl4)
        (fuel-level r4 fl3)
 
  	(place london) 
	 (place paris) 
	 (place jfk) 
	 (place bos)
	 
	 (rocket r1) 
	 (rocket r2) 
	 (rocket r3) 

	 (cargo avrim) 
	 
	 (at r1 jfk)
	 (at r2 london)
	 (at r3 london)


	 (rocket r4) 
	 (at r4 bos)
	 
	 (at avrim paris)
	 )
  (:goal (and 
          (at avrim jfk)
))
)

; plan
1. (move r1 jfk paris fl6 fl5)
   deleted: (at r1 jfk) (fuel-level r1 fl6)
   added: (at r1 paris) (fuel-level r1 fl5)
   goals met: 0 of 1
2. (load avrim r1 paris)
   deleted: (at avrim paris)
   added: (in avrim r1)
   goals met: 0 of 1
3. (move r1 paris jfk fl5 fl4)
   deleted: (at r1 paris) (fuel-level r1 fl5)
   added: (at r1 jfk) (fuel-level r1 fl4)
   goals met: 0 of 1
4. (unload avrim r1 jfk)
   deleted: (in avrim r1)
   added: (at avrim jfk)
   goals met: 1 of 1
